request/nodes.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
************************************************************************
*                       XML Example for 5620 SAM 13.0R1
*
*   Sample Name: Find.xml
*
*   Description: This example demonstrates a find request to retrieve information
*                          about all managed NEs.
*		      A result filter is used to specify that only the objectFullName and siteId 
*                         should be returned. 
*
*   Preconditions: 1. None.         
*
*   Notes: 1. None 
* 
*************************************************************************
*   Copyright (c) 2014 Alcatel-Lucent.  All rights reserved.
*   For Alcatel-Lucent disclaimer, refer to AlcatelLucentDisclaimer.txt
*
**************************************************************************
-->
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP:Header>
    <header xmlns="xmlapi_1.0">
      <security>
        <user>admin</user>
        <password hashed="false">5620Sam!</password>
      </security>
      <requestID>client1:0</requestID>
    </header>  
  </SOAP:Header>
  <SOAP:Body>
    <find xmlns="xmlapi_1.0">
      <fullClassName>netw.NetworkElement</fullClassName>
      <resultFilter>
        <attribute>siteId</attribute>
        <attribute>objectFullName</attribute>
        <attribute>deploymentState</attribute>
        <attribute>name</attribute>
        <attribute>neState</attribute>
	   <attribute>coordinates</attribute>
	   <attribute>chassisType</attribute>
	   <attribute>baseMacAddress</attribute>
	   <attribute>inBandL3ManagementIf</attribute>
	   <attribute>inBandSystemAddress</attribute>
	   <attribute>mgmtIpAddrType</attribute>
	   <attribute>ipAddress</attribute>
	   <attribute>location</attribute>
	   <attribute>locationId</attribute>
	   <attribute>longitudeInDegrees</attribute>
	   <attribute>latitudeInDegrees</attribute>
	   <attribute>olcState</attribute>
	   <attribute>outOfBandAddress</attribute>
	   <attribute>productType</attribute>
	   <attribute>systemAddress</attribute>
	   <attribute>sysDescription</attribute>	
	   <attribute>sysObjectId</attribute>	
<children/> 
      </resultFilter>
    </find>
  </SOAP:Body>
</SOAP:Envelope>
